[
  {
    "name": "Ana",
    "description": "Ana is a high-skill hitscan support hero. Her grenade can change the course of a battle, and her ultimate can enable other heroes such as Genji and Reinhardt to shine on the battlefield.",
    "general_rol": "Support",
    "secondary_rol": "MainSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Ana", "Amari", "Sniper", "Granny", "Grandma", "Grandmother"]
  },
  {
    "name": "Ashe",
    "description": "Hitscan DPS with good terrain control, her dynamite is effective against compositions that tend to group together, her ultimate BOB is very good for contesting points and checking angles.",
    "general_rol": "Damage",
    "secondary_rol": "HitscanDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Ashe", "Ash", "Sniper", "BOB", "B.O.B.", "Dynamite"]
  },
  {
    "name": "Baptiste",
    "description": "Baptiste is a flex support with good damage and healing capabilities. His immortality field can give a few extra seconds of life to your teammates in battle, and his ultimate, Amplification Matrix, can be used both to damage your enemies and to boost the healing of your allies.",
    "general_rol": "Support",
    "secondary_rol": "FlexSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Baptiste", "Bap", "Immortality", "Larry", "Disco","Mauga"]
  },
  {
    "name": "Bastion",
    "description": "Despite having multiple configurations, Bastion is not a very flexible hero. His damage output is notably increased in his assault form, but in other situations, he is often vulnerable. His grenade offers an interesting form of mobility, and his ultimate requires good planning to be used effectively. In the right hands, he can be a devastating hero against the enemy team.",
    "general_rol": "Damage",
    "secondary_rol": "HitscanDamage",
    "shields": 0,
    "health": 200,
    "armor": 100,
    "on_rotation": true,
    "nicks": ["Bastion", "Robot", "Bot"]
  },
  {
    "name": "Brigitte",
    "description": "Although her abilities suggest Brigitte should be played on the front lines, she's better played in a defensive, advantageous position. Her range healing, shield, and bash make the enemy backline unkillable, and her ultimate is the reward for those who've patiently waited to engage in battle at the front line.",
    "general_rol": "Support",
    "secondary_rol": "OffSupport",
    "shields": 250,
    "health": 200,
    "armor": 50,
    "on_rotation": true,
    "nicks": ["Brigitte", "Brig", "4Gitte", "Lindholm"]
  },
  {
    "name": "Cassidy",
    "description": "Close- to mid-range hitscan, useful for applying pressure against aggressive tanks or other DPS, especially effective against flankers. The grenade can be used to force cooldowns, and the ultimate allows the user to control open areas of the map.",
    "general_rol": "Damage",
    "secondary_rol": "HitscanDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Cassidy", "Mcree", "Mccre", "Cowboy", "Jesse"]
  },
  {
    "name": "D.Va",
    "description": "A misunderstood tank that is very good for assassinating enemy backlines, but also for defending its own. It is especially effective on maps with different highgrounds. Its defense matrix can deny important ultimates (like Zarya's graviton) and its ultimate is particularly useful against teams with few shields.",
    "general_rol": "Tank",
    "secondary_rol": "OffTank",
    "shields": 0,
    "health": 350,
    "armor": 350,
    "on_rotation": true,
    "nicks": ["D.Va", "DVa", "Mecha", "Tokki", "Hana"]
  },
  {
    "name": "Doomfist",
    "description": "A tank with great flight control helps him appear from any rooftop to torment the enemy lines. His fist is especially useful on maps with holes to fall into, and his ultimate is practically an extra cooldown when fighting.",
    "general_rol": "Tank",
    "secondary_rol": "MainTank",
    "shields": 0,
    "health": 450,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Doomfist", "Doom", "Fist", "They Say", "dey say", "deysey"]
  },
  {
    "name": "Echo",
    "description": "Flying hero with high damage potential, his sticky bombs are effective against heroes that tend to stay in one position, and his beam is effective at finishing low health targets. His ultimate requires extensive knowledge of all Overwatch heroes to be used effectively.",
    "general_rol": "Damage",
    "secondary_rol": "FlankDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Echo", "Moth", "Copy"]
  },
  {
    "name": "Genji",
    "description": "Hero with great mobility, effective on maps with flanking lanes and multiple heights. His ultimate is particularly strong and devastating. Depending on the damage dealt by his shurikens, his mid-game performance can either serve as a means to build up his ultimate or to assassinate the enemy backline.",
    "general_rol": "Damage",
    "secondary_rol": "FlankDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Genji", "Ninja", "Naruto", "Hokage"]
  },
  {
    "name": "Hanzo",
    "description": "Sniper with great mobility, very effective at pressuring tanks with his Storm Arrows and defending points against flankers with Sonic Arrow. His ultimate is very strong in combination with other ultimates, especially when used in conjunction with Zarya's Graviton.",
    "general_rol": "Damage",
    "secondary_rol": "ProjectileDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Hanzo", "Archer", "Sasuke"]
  },
  {
    "name": "Hazard",
    "description": "",
    "general_rol": "Tank",
    "secondary_rol": "MainTank",
    "shields": 0,
    "health": 425,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Hazard", "Phreak", "Phreaks", "Punk", "Frank", "Findlay", "Docherty", "Haz", "Scottish", "Rocker"
    ]
  },
  {
    "name": "Illari",
    "description": "Illari uses the sun as a source of power for both healing and damage. She focuses this power on her Healing Pylon to automatically heal her teammates in its line of sight. She can also channel this power into her weapon to provide a rapid burst of healing or to shoot enemies at long distances. Her ultimate ability harnesses even more of this power, enveloping her enemies in the radiant energy of a captive sun.",
    "general_rol": "Support",
    "secondary_rol": "OffSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["illari","sun","sunlight","peru","inti"]
  },
  {
    "name": "Junker Queen",
    "description": "Feast or famine tank that heals the more damage she does, her knife and axe allow her to make devastating melee attacks that cause bleeding and lure her victims, her ultimate not only does the same but also prevents her enemies from being healed.",
    "general_rol": "Tank",
    "secondary_rol": "OffTank",
    "shields": 0,
    "health": 425,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Queen", "Junker", "Wastelander", "Junk", "Odessa", "Dez", "Stone"
    ]
  },
  {
    "name": "Junkrat",
    "description": "High damage and area denial are defining traits of this hero, though he may be vulnerable to heroes with high mobility. However, he also has the ability to wreak havoc in enemy lines. His ultimate may be weak against hitscan heroes, but if used correctly, it can quickly change the course of battle.",
    "general_rol": "Damage",
    "secondary_rol": "ProjectileDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Junkrat", "Junk", "Rat"]
  },
  {
    "name": "Juno",
    "description": "A Martian.",
    "general_rol": "Support",
    "secondary_rol": "MainSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Juno", "Astronaut", "Space", "Martian", "Mars"]
  },
  {
    "name": "Kiriko",
    "description": "A support designed to deal damage, her teleport makes her elusive, and the Suzu Protection can prevent other supports like Ana from disrupting your team. The Kitsune Rush accelerates your team's cooldowns and damage in ways the enemy team can't handle.",
    "general_rol": "Support",
    "secondary_rol": "OffSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Kiriko", "Kamori", "Protector", "Kunoichi", "Fox", "Kitsune"]
  },
  {
    "name": "Lifeweaver",
    "description": "Lifeweaver uses hard light to replicate the power of nature and provide a complete healing kit to their team. Their utility protects the team from death traps, secures kills, and even mitigates their own miscalculations. Their petal and dash abilities make it difficult for enemies to dive them and the Tree of Life can be used as a team-saving tool or as an obstacle against the enemy team.",
    "general_rol": "Support",
    "secondary_rol": "OffSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["lifeweaver","life","weaver","tree","flower"]
  },
  {
    "name": "Lucio",
    "description": "Dynamic main support, his ability to increase the speed of his teammates' movement enables many fast compositions such as Dive and Rush. His Soundwave is useful on maps with holes to fall into, and his Healing Song can make him effective in healing multiple heroes while dealing damage.",
    "general_rol": "Support",
    "secondary_rol": "OffSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Lucio", "Frog", "Frogger", "DJ", "Brasil","Mafia"]
  },
  {
    "name": "Mauga",
    "description": "Mauga is the Berserker Tank. Unstoppable, he can charge at his enemies without being halted. His two weapons, starting with Gunny, can ignite his targets. Subsequently, Cha-Cha can inflict critical damage on those already on fire. His ultimate is a massive cage where Mauga executes everything he has captured or protects his team temporarily from the enemy team.",
    "general_rol": "Tank",
    "secondary_rol": "OffTank",
    "shields": 0,
    "health": 500,
    "armor": 150,
    "on_rotation": true,
    "nicks": ["Mauga", "Maui", "Baptiste","Samoa","Chaingun","Cha-Cha","Gunny","Berseker"]
  },
  {
    "name": "Mei",
    "description": "Hybrid DPS that can serve as a secondary tank. Her wall allows her to trap enemies, especially enemy tanks crossing a choke. Her ultimate is weak, but when combined with other skills or ultimates, it could be deadly.",
    "general_rol": "Damage",
    "secondary_rol": "ProjectileDamage",
    "shields": 0,
    "health": 250,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Mei", "Ice", "Demon", "Scientist", "Cold", "Snow", "Snowball"]
  },
  {
    "name": "Mercy",
    "description": "A flying support who enables her teammates, especially damage heroes, with her healing and damage boost. As a moth, her mobility makes her difficult to kill, making her effective in contesting points and wasting the enemy's time.",
    "general_rol": "Support",
    "secondary_rol": "FlexSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Mercy", "Medic", "Angela", "Valkyrie", "Witch", "Fly"]
  },
  {
    "name": "Moira",
    "description": "Moira has a great amount of healing combined with the ability to easily avoid death using her Fade ability. Her ability to reach the enemy backline easily can make her a very dangerous support.",
    "general_rol": "Support",
    "secondary_rol": "MainSupport",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": false,
    "nicks": ["Moira", "Otaku", "Mora"]
  },
  {
    "name": "Orisa",
    "description": "A tank with a large amount of health and low cooldown times that make her virtually invulnerable to enemy damage and also a strong option for contesting objectives. Unfortunately, her ultimate is unimpressive and easy to evade, and enemy heroes with high mobility can make your team vulnerable to dive compositions if she is played.",
    "general_rol": "Tank",
    "secondary_rol": "MainTank",
    "shields": 0,
    "health": 275,
    "armor": 275,
    "on_rotation": false,
    "nicks": ["Orisa", "Horse", "Efi"]
  },
  {
    "name": "Pharah",
    "description": "Designed to stay airborne, Pharah can be a formidable aerial threat. Although she can be countered by hitscan heroes, if played smartly as a flanker, she can become the perfect counter to those who try to take her down. Her ultimate is often used as a last resort to quickly respawn back at base.",
    "general_rol": "Damage",
    "secondary_rol": "ProjectileDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Pharah", "Amari", "Fly"]
  },
  {
    "name": "Ramattra",
    "description": "Referred to as the \"Tempo\" tank, Ramattra can shapeshift and change the way he plays, from a tank with good ranged poke damage to a closer ranged tank that kills enemies with his fists. His ultimate is very effective in overtime when the enemy team can't leave the objective.",
    "general_rol": "Tank",
    "secondary_rol": "MainTank",
    "shields": 1000,
    "health": 450,
    "armor": 150,
    "on_rotation": true,
    "nicks": ["Ramattra", "Ramatra", "Rammatra", "Rammattra"]
  },
  {
    "name": "Reaper",
    "description": "Reaper is a very powerful hero with special moves like his ultimate that can eliminate enemy heroes in a wide area. His teleport ability allows him to gain advantageous positions, while his wraith form enables him to escape from disadvantageous situations. He is equipped with two revolvers that are particularly useful for executing kills, especially from flanking positions.",
    "general_rol": "Damage",
    "secondary_rol": "FlankDamage",
    "shields": 0,
    "health": 250,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Reaper", "Gabriel", "Reyes", "Death"]
  },
  {
    "name": "Reinhardt",
    "description": "The epitome of a tank in Overwatch, Reinhardt is formidable at close range and can defend his team with his shield, closing distances, interrupting enemy cooldowns, and buying his team more time for protection. His ultimate is vulnerable to enemy shields, but if used smartly, it can alter the outcome of the battle.",
    "general_rol": "Tank",
    "secondary_rol": "MainTank",
    "shields": 1200,
    "health": 325,
    "armor": 300,
    "on_rotation": true,
    "nicks": ["Reinhardt", "Rein", "Shield", "Crusader", "Garen", "German"]
  },
  {
    "name": "Roadhog",
    "description": "Tank with a high amount of health and survivability, his hook allows him to reposition heroes to disadvantageous positions. He lacks mobility, but in the right hands, he can be a deadly tank.",
    "general_rol": "Tank",
    "secondary_rol": "OffTank",
    "shields": 0,
    "health": 700,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Roadhog", "Road", "Hog", "Pig", "Hook"]
  },
  {
    "name": "Sigma",
    "description": "Bunker tank with a large amount of damage. Its shield can protect heroes who prefer to hold a static position. Its Accretion is a useful stun that can disrupt enemy abilities, and its ultimate not only deals significant damage but can also be used to reposition in the battlefield.",
    "general_rol": "Tank",
    "secondary_rol": "FlexTank",
    "shields": 900,
    "health": 350,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Sigma", "Foot", "Foots", "Gravity", "Melody", "Fly", "Rock"]
  },
  {
    "name": "Sojourn",
    "description": "Great mobility combined with the possibility of easy kills thanks to the rail gun. The Power Slide allows Sojourn to quickly position himself to assassinate his targets, and the Disruptor Shot is a good tool for denying zones.",
    "general_rol": "Damage",
    "secondary_rol": "HitscanDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Sojourn", "Sojorn", "Legs", "Tights", "Vivian", "Chase"]
  },
  {
    "name": "Soldier: 76",
    "description": "A very basic hero that is easy to learn, Soldier: 76 has good damage potential, especially against airborne targets. His sprint ability allows him to quickly reposition himself to advantageous positions, and his ultimate is a literal aimbot that automatically targets enemies.",
    "general_rol": "Damage",
    "secondary_rol": "HitscanDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Soldier: 76", "Soldier", "76", "Jack", "Morrison", "Legs"]
  },
  {
    "name": "Sombra",
    "description": "Sombra is the ultimate spy hero, thanks to her ability to traverse the battlefield undetected by the enemy. Her hack instantly disables enemy abilities and leaves them vulnerable to her damage. Her Translocator allows her to escape from disadvantageous positions, and her EMP leaves enemies vulnerable to damage from both her and her teammates.",
    "general_rol": "Damage",
    "secondary_rol": "FlankDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Sombra", "Hacker", "Mexican", "Mexico", "Los Muertos"]
  },
  {
    "name": "Symmetra",
    "description": "Very lethal at close distances, Symmetra uses light to do damage with her weapon and her turrets, but also she can build a teleport that allows her team to acquire advantageous positions. The damage her weapon does increases the longer it stays on target.",
    "general_rol": "Damage",
    "secondary_rol": "ProjectileDamage",
    "shields": 125,
    "health": 100,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Symmetra", "Sym", "Summoner", "Teleporter", "TP", "Microwave"]
  },
  {
    "name": "Torbjörn",
    "description": "Torbjörn is the quintessential engineer hero. He can place a turret that is very effective at stopping flankers, his primary weapon can deal poke damage at a distance, and his ultimate can completely deny an area of the map.",
    "general_rol": "Damage",
    "secondary_rol": "ProjectileDamage",
    "shields": 0,
    "health": 200,
    "armor": 50,
    "on_rotation": true,
    "nicks": ["Torbjörn", "Torbjorn", "Torb", "Dwarf", "Enginner", "Lindholm"]
  },
  {
    "name": "Tracer",
    "description": "Speed and high damage combine in Tracer, who can be almost unkillable thanks to his blinks and the ability to go back in time. This makes heroes lacking mobility very vulnerable to his Pulse Pistols, and the Pulse Bomb sticks to enemies, condemning them to an explosive death.",
    "general_rol": "Damage",
    "secondary_rol": "FlankDamage",
    "shields": 0,
    "health": 150,
    "armor": 0,
    "on_rotation": false,
    "nicks": ["Tracer", "Pilot", "Lena", "Light", "Time", "Recall"]
  },
  {
    "name": "Venture",
    "description": "Known as the miner hero, Venture digs their way through the battlefield using their drill, pushing enemies into the void or inflicting a lot of damage in a second. But be careful, wasting your cooldowns is easy so you can end up in the wrong place at the wrong time without noticing; their ultimate inflicts heavy damage, but it can be easy to avoid.",
    "general_rol": "Damage",
    "secondary_rol": "FlankDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Venture", "Venchure", "Adventure", "I Can Dig That", "Rock Eater", "Rock Guy", "Archeologist", "Excavator", "Miner"]
  },
  {
    "name": "Widowmaker",
    "description": "The ultimate sniper, Widowmaker is lethal on maps with long sightlines but is very weak against heroes that attack up close, like dive heroes. Her poison mine is useful for detecting flankers early.",
    "general_rol": "Damage",
    "secondary_rol": "HitscanDamage",
    "shields": 0,
    "health": 200,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Widowmaker", "Widow", "Spider", "Sniper", "Venom"]
  },
  {
    "name": "Winston",
    "description": "This gorilla is very good on maps with a lot of heights. His Tesla Cannon can do a lot of damage to various targets in one area, and his jump combined with the secondary shot of his cannon can eliminate squishy targets easily. His ultimate can be used as a second life, especially when Winston is deep in the enemy backline.",
    "general_rol": "Tank",
    "secondary_rol": "MainTank",
    "shields": 700,
    "health": 350,
    "armor": 200,
    "on_rotation": true,
    "nicks": [
      "Winston",
      "Monkey",
      "Scientist",
      "Moon",
      "Monky",
      "Angry",
      "Angy"
    ]
  },
  {
    "name": "Wrecking Ball",
    "description": "The most mobile hero in the game, this tank is the nightmare of snipers, mostly because in his ball form, he doesn't have a critical point that can be shot. His piledriver and grappling claw can put enemies in vulnerable positions that can be exploited by his team. His ultimate denies an area of the map, but it can be easily countered by other enemy abilities.",
    "general_rol": "Tank",
    "secondary_rol": "FlexTank",
    "shields": 0,
    "health": 550,
    "armor": 150,
    "on_rotation": true,
    "nicks": [
      "Wrecking Ball",
      "Wrecking",
      "Ball",
      "Hammond",
      "Hamster",
      "Rat",
      "Moon"
    ]
  },
  {
    "name": "Zarya",
    "description": "Zarya wields a powerful weapon with which she can carry her entire team. Her shields allow her to accumulate energy, which she uses to deal more damage. Her ultimate gathers enemies at a close distance, where they are vulnerable to her high-energy beam.",
    "general_rol": "Tank",
    "secondary_rol": "OffTank",
    "shields": 625,
    "health": 250,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Zarya", "Russian", "Rusia", "Strong", "Gravity"]
  },
  {
    "name": "Zenyatta",
    "description": "Zen is a glass cannon in every sense of the word. His damage can be more useful than his healing, especially the potential damage of his Discord Orb. The only form of defense he has is an incredible kick that can leave enemies within striking distance.",
    "general_rol": "Support",
    "secondary_rol": "OffSupport",
    "shields": 150,
    "health": 50,
    "armor": 0,
    "on_rotation": true,
    "nicks": ["Zenyatta", "Zen", "Monk", "Omnic", "Budist"]
  }
]
